INSERT INTO readers (reader_name, phone_number) VALUES
    ('Анна Петрова', '+7-900-111-22-33'),
    ('Иван Соколов', '+7-900-222-33-44'),
    ('Мария Ким', '+7-900-333-44-55'),
    ('Олег Васильев', '+7-900-444-55-66');



INSERT INTO authors (author_name) VALUES
    ('Михаил Булгаков'),
    ('Федор Достоевский'),
    ('Лев Толстой'),
    ('Илья Ильф'),
    ('Евгений Петров'),
    ('Аркадий Стругацкий'),
    ('Борис Стругацкий');




INSERT INTO books (isbn, book_title, pub_year) VALUES
    ('978-5-17-118366-8', 'Мастер и Маргарита', 1967),
    ('978-5-389-06256-6', 'Преступление и наказание', 1866),
    ('978-5-04-116716-3', 'Война и мир', 1869),
    ('978-5-699-12014-7', 'Золотой теленок', 1931),
    ('978-5-389-03713-7', 'Пикник на обочине', 1972);

INSERT INTO books_authors (isbn, aid) VALUES
    ('978-5-17-118366-8', 1),
    ('978-5-389-06256-6', 2),
    ('978-5-04-116716-3', 3),
    ('978-5-699-12014-7', 4),
    ('978-5-699-12014-7', 5),
    ('978-5-389-03713-7', 6),
    ('978-5-389-03713-7', 7);



INSERT INTO loans (rid, isbn, loan_date, return_date, returned_date) VALUES
    (1, '978-5-17-118366-8', '2026-01-10', '2026-01-24', '2026-01-20'),
    (1, '978-5-389-06256-6', '2026-02-01', '2026-02-15', '2026-02-14'),
    (2, '978-5-04-116716-3', '2026-02-10', '2026-02-24', '2026-02-25'),
    (3, '978-5-699-12014-7', '2026-03-01', '2026-03-15', '2026-03-10'),


    (1, '978-5-389-03713-7', '2026-03-10', '2026-03-24', NULL),
    (4, '978-5-17-118366-8', '2026-03-12', '2026-03-26', NULL);



UPDATE readers
SET phone_number = '+7-900-999-88-77'
WHERE rid = 1;

UPDATE loans
SET returned_date = '2026-03-20'
WHERE lid = 5;

INSERT INTO readers (reader_name, phone_number)
VALUES ('Тестовый Читатель', '+7-900-000-00-00');

DELETE FROM readers
WHERE reader_name = 'Тестовый Читатель';